# homebrew
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/core'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'rcmdnk/file'
tap 'argon/mas'
brew 'argon/mas/mas'
mas 'installed apps found', id: No

# editor
brew 'lua'
brew 'tmux'
brew 'vim', args: ['with-lua']
brew 'ctags'
brew 'zsh'

# ruby
brew 'ruby-build'
brew 'rbenv'
brew 'imagemagick'
brew 'libevent'
brew 'openssl'
brew 'readline'

# javascript
brew 'node'

# python
brew 'python'
brew 'python3'

# data analysis
cask 'aquaterm'
cask 'cuda'
cask 'java'
cask 'xquartz'
brew 'gnuplot', args: ['with-aquaterm', 'with-x11']
brew 'homebrew/python/numpy'
brew 'homebrew/science/veclibfort'
brew 'homebrew/science/arpack'
brew 'homebrew/science/glpk'
brew 'homebrew/science/hdf5'
brew 'homebrew/science/qhull'
brew 'homebrew/science/qrupdate'
brew 'homebrew/science/octave'
brew 'homebrew/science/opencv'
brew 'homebrew/science/suite-sparse421'

# utilities
brew 'coreutils'
brew 'nkf'
brew 'osxutils'
brew 'pwgen'
brew 'tree'
brew 'wget'
cask 'virtualbox'

# database
brew 'mongodb'
brew 'mysql'
brew 'sqlite'

# development tools
cask 'google-chrome'
cask 'firefox'
cask 'sublime-text'
cask 'vagrant'
cask 'slack'
cask 'atom'
cask 'filezilla'
cask 'macdown'

# utility mac apps
cask 'bettertouchtool'
cask 'fluid'
cask 'licecap'
cask 'google-japanese-ime'

# others
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'bazel'
brew 'pkg-config'
brew 'gmp'
brew 'isl'
brew 'cloog'
brew 'cmake'
brew 'doxygen'
brew 'eigen'
brew 'jpeg'
brew 'libtiff'
brew 'little-cms2'
brew 'ghostscript'
brew 'epstool'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'fftw'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'libtool'
brew 'gd'
brew 'gdbm'
brew 'gl2ps'
brew 'graphicsmagick'
brew 'ilmbase'
brew 'openexr'
brew 'libusb', args: ['universal']
brew 'libfreenect'
brew 'pcre'
brew 'plotutils'
brew 'pstoedit'
brew 'swig'
brew 'szip'
brew 'tbb'
